{"question_id": 1, "text": "How can I improve my time management skills?", "category": "generic", “text_th”: “ทำอย่างไรฉันถึงจะสามารถพัฒนาทักษะการบริหารเวลาได้”}
{"question_id": 2, "text": "What are the most effective ways to deal with stress?", "category": "generic", “text_th”: “วิธีใดมีประสิทธิภาพที่สุดในการจัดการความเครียด”}
{"question_id": 3, "text": "What are the main differences between Python and JavaScript programming languages?", "category": "generic", “text_th”: “อะไรคือความแตกต่างระหว่างภาษาไพธอนและจาวาสคริปต์”}
{"question_id": 4, "text": "How can I increase my productivity while working from home?", "category": "generic", “text_th”: “ทำอย่างไรฉันถึงจะสามารถเพิ่มประสิทธิภาพการทำงานจากที่บ้านได้”}
{"question_id": 5, "text": "Can you explain the basics of quantum computing?", "category": "generic", “text_th”: “คุณช่วยอธิบายหลักการพื้นฐานของการคำนวณควอนตัมได้หรือไม่”}
{"question_id": 6, "text": "What are the differences between plant-based and animal-based protein sources?", "category": "generic", “text_th”: “อะไรคือความแตกต่างระหว่างแหล่งโปรตีนที่ผลิตจากพืชและผลิตจากสัตว์”}
{"question_id": 7, "text": "How can I develop my critical thinking skills?", "category": "generic", “text_th”: “ทำอย่างไรฉันถึงจะสามารถพัฒนาทักษะการคิดวิเคราะห์ได้”}
{"question_id": 8, "text": "What are the major challenges faced by the education sector today?", "category": "generic", “text_th”: “อะไรคือปัญหาหลักของภาคการศึกษาในปัจจุบัน”}
{"question_id": 9, "text": "What are the primary factors that influence consumer behavior?", "category": "generic", “text_th”: “อะไรคือปัจจัยหลักที่มีผลต่อพฤติกรรมผู้บริโภค”}
{"question_id": 10, "text": "What are the most effective strategies for conflict resolution in the workplace?", "category": "generic", “text_th”: “อะไรคือยุทธศาสตร์ที่ดีที่สุดสำหรับการแก้ปัญหาความขัดแย้งในที่ทำงาน”}
{"question_id": 11, "text": "What are some potential implications of using a single-use plastic bottle versus a reusable bottle on both the environment and human health?", "category": "knowledge", “text_th”: “อะไรคือผลกระทบต่อสิ่งแวดล้อมและสุขภาพที่อาจเกิดจากการใช้ขวดพลาสติกแบบใช้ครั้งเดียวทิ้งเมื่อเทียบกับขวดแบบใช้ซ้ำได้”}
{"question_id": 12, "text": "What factors would you consider when designing an inclusive and accessible public transportation system?", "category": "knowledge", “text_th”: “อะไรคือปัจจัยที่ควรคำนึงในการออกแบบระบบคมนาคมขนส่งที่ทุกคนเข้าถึงได้”}
{"question_id": 13, "text": "How can governments utilize fiscal and monetary policies to combat economic recessions?", "category": "knowledge", “text_th”: “รัฐบาลสามารถใช้ประโยชน์จากนโยบายทางการคลังและเงินในการแก้ปัญหาเศรษฐกิจถดถอยได้อย่างไร”}
{"question_id": 14, "text": "How do language and cultural barriers affect the way people communicate and form relationships in multicultural societies?", "category": "knowledge", “text_th”: “อุปสรรคทางภาษาและวัฒนธรรมมีผลต่อวิธีการสื่อสารของคนและการสร้างความสัมพันธ์ในสังคมพหุวัฒนธรรมอย่างไร”}
{"question_id": 15, "text": "Describe a scenario where artificial intelligence could be used to improve the quality and efficiency of healthcare delivery.", "category": "knowledge", “text_th”: “อธิบายเหตุการณ์ที่สามารถใช้ปัญญาประดิษฐ์ในการพัฒนาคุณภาพและประสิทธิภาพการให้บริการสาธารณสุข”}
{"question_id": 16, "text": "Explain the process of gene editing using CRISPR-Cas9 technology, and discuss its potential applications and ethical implications.", "category": "knowledge", “text_th”: “อธิบายกระบวนการของการตัดต่อพันธุกรรมโดยเทคโนโลยี CRISPR-Cas9 และอภิปรายการประยุกต์ใช้ที่เป็นไปได้รวมถึงจริยธรรมที่เกี่ยวข้อง”}
{"question_id": 17, "text": "How do vaccinations work to protect individuals and communities from infectious diseases, and what is herd immunity?", "category": "knowledge", “text_th”: “งัตซีนทำงานอย่างไรในการปกป้องปัจเจกบุคคลและชุมชนจากโรคติดต่อ และอะไรคือภูมิคุ้มกันหมู่”}
{"question_id": 18, "text": "How do social media platforms influence the way people consume and share news, and what are the potential implications for the spread of misinformation?", "category": "knowledge", “text_th”: “แพลตฟอร์มโซเชียลมีเดียมีผลต่อวิธีการบริโภคและแบ่งปันข่าวสารอย่างไร และอะไรคือความเป็นไปได้ของการกระจายข้อมูลที่ผิด”}
{"question_id": 19, "text": "How do cultural, social, and economic factors influence people's food choices, and how can this knowledge be used to promote healthier diets?", "category": "knowledge", “text_th”: “ปัจจัยทางวัฒนธรรม สังคม และเศรษฐกิจมีผลต่อการเลือกอาหารอย่างไร และทำอย่างไรจึงจะสามารถใช้ความรู้นี้ในการส่งเสริมโภชนาการที่ดีต่อสุขภาพ”}
{"question_id": 20, "text": "Explain the process of natural selection and how it contributes to the evolution and adaptation of species.", "category": "knowledge", “text_th”: “อธิบายกระบวนการคัดสรรตามธรรมชาติว่าส่งผลต่อการวิวัฒนาการและการปรับตัวของสปีชีส์อย่างไร”}
{"question_id": 21, "text": "How would you introduce yourself as a medieval knight at a royal banquet?", "category": "roleplay", “text_th”: “คุณจะแนะนำตัวเองว่าเป็นอัศวินยุคกลางในงานเลี้ยงในวังอย่างไร”}
{"question_id": 22, "text": "As a pirate captain, what would you say to your crew to motivate them to search for hidden treasure?", "category": "roleplay", “text_th”: “ในฐานะกัปตันเรือโจรสลัด คุณจะพูดกับลูกเรือเพื่อสร้างกำลังใจในการหาสมบัติที่ซ่อนอยู่อย่างไร”}
{"question_id": 23, "text": "If you were a Shakespearean character, how would you declare your love for someone in a soliloquy?", "category": "roleplay", “text_th”: “ถ้าคุณเป็นตัวละครในนิยายของเชคสเปียร์ คุณจะพูดสารภาพรักกับใครคนนึงด้วยการพูดคนเดียวอย่างไร”}
{"question_id": 24, "text": "As a superhero, how would you explain your origin story to a curious child?", "category": "roleplay", “text_th”: “ในฐานะยอดมนุษย์ คุณจะเล่าต้นกำเนิดของตัวคุณให้กับเด็กที่สงสัยอย่างไร”}
{"question_id": 25, "text": "Imagine you are a time traveler from the year 3000. What technological advancements would you tell people about?", "category": "roleplay", “text_th”: “จินตนาการว่าคุณเป็นนักท่องเวลาจากปี 3000 เทคโนโลยีในอนาคตอะไรบ้างที่คุณจะเล่าให้คนอื่นฟัง”}
{"question_id": 26, "text": "As a sports commentator, describe the winning play in the final seconds of a championship game.", "category": "roleplay", “text_th”: “ในฐานะนักวิเคราะห์กีฬา อธิบายวิธีการชนะแบบเฉียดฉิวในรอบชิงชนะเลิศ”}
{"question_id": 27, "text": "Pretend to be a world-famous chef. How would you describe your signature dish to a panel of judges?", "category": "roleplay", “text_th”: “สมมติว่าคุณเป็นเชฟที่มีชื่อเสียงระดับโลก คุณจะอธิบายอาหารจานเด่นของคุณให้กับกรรมการอย่างไร”}
{"question_id": 28, "text": "You are a mountain climber reaching the summit of Mount Everest. Describe your emotions and the view from the top.", "category": "roleplay", “text_th”: “คุณเป็นนักปีนเขาที่กำลังถึงยอดเขาเอเวอเรสต์ อธิบายอารมณ์และภาพที่เห็นจากยอดเขาของคุณหน่อย”}
{"question_id": 29, "text": "As a space colonist on Mars, describe your daily life and the challenges you face living on another planet.", "category": "roleplay", “text_th”: “ในฐานะนักล่าอาณานิคมบนดาวอังคาร อธิบายวิถีชีวิตประจำวันและอุปสรรคที่เจอบนดาวอื่น”}
{"question_id": 30, "text": "Pretend to be a character in a post-apocalyptic world. Describe how you survive and the allies you encounter.", "category": "roleplay", “text_th”: “สมมติว่าเป็นตัวละครในโลกหลังหายนะ อธิบายว่าคุณรอดชีวิตและเจอเพื่อนได้อย่างไร”}
{"question_id": 31, "text": "How can you determine if a restaurant is popular among locals or mainly attracts tourists, and why might this information be useful?", "category": "common-sense", “text_th”: “คุณจะรู้ได้อย่างไรว่าร้านอาหารนี้มีชื่อเสียงในหมู่นักท่องเที่ยวหรือคนท้องถิ่น และทำไมข้อมูลนี้จึงมีประโยชน์”}
{"question_id": 32, "text": "What are some subtle clues that suggest someone is pretending to understand a topic or conversation when they are actually confused or uninformed?", "category": "common-sense", “text_th”: “อะไรคือเงื่อนงำเล็กๆน้อยๆที่บอกว่าคนๆหนึ่งแกล้งทำเป็นเข้าใจหัวข้อหรือบทสนทนาทั้งที่จริงๆแล้วเขากำลังสับสนและไม่รู้ข้อมูล”}
{"question_id": 33, "text": "Why might someone choose to use a paper map or ask for directions instead of relying on a GPS device or smartphone app?", "category": "common-sense", “text_th”: “ทำไมคนๆนึงจึงเลือกที่จะใช้แผนที่กระดาษในการถามทางมากกว่าพึ่งพาอุปกรณ์ GPS และแอปพลิเคชั่นบนสมาร์ทโฟน”}
{"question_id": 34, "text": "How can you determine if a person is genuinely interested in a conversation or simply being polite?", "category": "common-sense", “text_th”: “คุณจะรู้ได้อย่างไรว่าคนๆหนึ่งสนใจในบทสนทนานั้นจริงๆหรือแค่เป็นคนสุภาพ”}
{"question_id": 35, "text": "Why might someone prefer to shop at a small, locally-owned business instead of a large chain store, even if the prices are higher?", "category": "common-sense", “text_th”: “ทำไมคนๆหนึ่งจึงชอบที่จะซื้อของในร้านเล็กๆของคนในท้องถิ่นมากกว่าร้านใหญ่ที่มีสาขาถึงแม้ว่าราคาอาจแพงกว่า”}
{"question_id": 36, "text": "How can you assess the credibility of a source of information, such as a news article or blog post, without relying solely on the reputation of the author or publisher?", "category": "common-sense", “text_th”: “คุณจะประเมินความน่าเชื่อถือของแหล่งข้อมูล อาทิ ข่าว หรือบล็อก โดยที่ไม่ยึดแต่ชื่อเสียงของผู้เขียนหรือสำนักพิมพ์ได้อย่างไร”}
{"question_id": 37, "text": "Why do some people enjoy the sensation of being scared, such as by watching horror movies or going on roller coasters, while others avoid these experiences?", "category": "common-sense", “text_th”: “ทำไมบางคนจึงสนุกกับการกลัว เช่น การดูหนังสยองขวัญ การขึ้นรถไฟเหาะ แต่บางคนกลับพยายามหลีกเลี่ยงประสบการณ์เหล่านั้น”}
{"question_id": 38, "text": "How can observing the behavior of other people in a social situation provide clues about cultural norms and expectations?", "category": "common-sense", “text_th”: “จะสังเกตพฤติกรรมของคนอื่นในสถานการณ์สังคมว่าสังคมนั้นมีค่านิยมและบรรทัดฐานทางสังคมอย่างไรได้อย่างไร”}
{"question_id": 39, "text": "Do we have a moral obligation to explore space, or should we focus on solving Earth's problems first?", "category": "common-sense", “text_th”: “เรามีข้อผูกมัดทางศีลธรรมในการสำรวจอวกาศ หรือเราควรมุ่งเป้าการแก้ปัญหาที่มีบนโลกมากกว่า”}
{"question_id": 40, "text": "In a world where automation is becoming increasingly prevalent, is it more important to prioritize job creation or technological progress?", "category": "common-sense", “text_th”: “ในโลกที่ทุกอย่างกลายเป็นระบบอัตโนมัติ อะไรสำคัญกว่าระหว่างการสร้างงานหรือความก้าวหน้าทางเทคโนโลยี”}
{"question_id": 41, "text": "How many times does the average human blink in a lifetime? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "โดยเฉลี่ยนแล้ว มนุษย์กระพริบตากี่ครั้งในหนึ่งชั่วชีวิต พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 42, "text": "How many atoms are in a grain of salt? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "ในเกลือหนึ่งเม็ดมีอะตอมกี่อัน พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 43, "text": "How many lightning strikes occur on Earth each day? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "โลกเกิดฟ้าผ่าวันละกี่ครั้ง พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 44, "text": "How many balloons would it take to lift a house like in the movie \"Up\"? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "จะต้องใช้ลูกโป่งกี่ลูกถึงจะยกบ้านขึ้นได้เหมือนในหนัง Up พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 45, "text": "How many text messages are sent globally in a minute? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "ในหนึ่งนาทีมีข้อความถูกส่งกี่ข้อความทั่วโลก พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 46, "text": "How many words are spoken daily on Earth? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "ในแต่ละวันมีคำถูกพูดวันละกี่คำบนโลก พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 47, "text": "How many snowflakes fall during a typical winter? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "ในฤดูหนาวปกติ มีเกล็ดหิมะตกลงมาเท่าไหร่ พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 48, "text": "How many pages are in all the books ever written? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "มีกี่หน้าในหนังสือทุกเล่มที่เคยถูกเขียนขึ้น พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 49, "text": "How many times has the Earth orbited the Sun since the beginning of life? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "โลกหมุนรอบดวงอาทิตย์มาแล้วกี่รอบตั้งแต่เกิดสิ่งมีชีวิตขึ้นมา พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 50, "text": "How many songs have been recorded throughout history? Try to explain your answer. Your explanation should take the reader through your reasoning step-by-step.", "category": "fermi", "text_th": "เพลงถูกอัดมาแล้วกี่เพลงตลอดประวัติศาสตร์ พยามอธิบายคำตอบ คำอธิบายควรบอกผู้อ่านให้ทราบถึงกระบวนการให้เหตุผลเป็นขั้นตอน"}
{"question_id": 51, "text": "What if the Internet had been invented during the Renaissance period?", "category": "counterfactual", "text_th": "จะเกิดอะไรขึ้นถ้าอินเตอร์เน็ตถูกคิดค้นขึ้นในสมัยเรอเนซองส์"}
{"question_id": 52, "text": "What if the Aztecs had successfully repelled the Spanish conquistadors?", "category": "counterfactual", "text_th": "สมมุติว่าชาวแอซเท็กสามารถขับไล่ผู้รุกรานชาวเสปนออกไปได้จะเกิดอะไรขึ้น"}
{"question_id": 53, "text": "What if the Black Death had not occurred in the 14th century?", "category": "counterfactual", "text_th": "ถ้าไม่เกิดการระบาดของกาฬโรคครั้งใหญ่ในศตวรรษที่ 14 จะเกิดอะไรขึ้น"}
{"question_id": 54, "text": "What if Isaac Newton had focused on biology instead of physics?", "category": "counterfactual", "text_th": "ถ้าไอแซค นิวตั้นสนใจชีววิทยามากกว่าฟิสิกส์จะเกิดอะไรขึ้น"}
{"question_id": 55, "text": "What if the Beatles had never formed as a band?", "category": "counterfactual", "text_th": "จะเกิดอะไรขึ้นถ้า The Beatles ไม่ได้ตั้งวงขึ้นมา"}
{"question_id": 56, "text": "What if Alan Turing had not cracked the Enigma code during World War II?", "category": "counterfactual", "text_th": "ถ้าอลัน ทูริ่งไม่สามารถถอดรหัสอินิกม่าได้สำเร็จในช่วงสงครามโลกครั้งที่สองจะเกิดอะไรขึ้น"}
{"question_id": 57, "text": "What if the Suez Canal had never been constructed?", "category": "counterfactual", "text_th": "จะเกิดอะไรขึ้นถ้าคลองซูเอซไม่เคยถูกสร้าง"}
{"question_id": 58, "text": "What if the Maya civilization had never mysteriously collapsed?", "category": "counterfactual", "text_th": "จะเป็นอย่างไรถ้าอารยธรรมมายาไม่เคยล่มสลายไปอย่างมีเงื่อนงำ"}
{"question_id": 59, "text": "What if Christopher Columbus had not discovered the Americas?", "category": "counterfactual", "text_th": "ถ้าคริสโตเฟอร์ โคลัมบัสไม่เคยพบทวีปอเมริกาจะเป็นอย่างไร"}
{"question_id": 60, "text": "What if Vincent van Gogh had been a successful artist during his lifetime?", "category": "counterfactual", "text_th": "ถ้าวินเซนท์ แวนโก๊ะประสบความสำเร็จในฐานะศิลปินในระหว่างที่ยังมีชีวิตอยู่จะเกิดอะไรขึ้น"}
{"question_id": 61, "text": "Develop a C++ program that reads a text file line by line and counts the number of occurrences of a specific word in the file.", "category": "coding", "text_th": "เขียนโปรแกรมภาษา C++ ที่จะอ่านไฟล์ text ทีละบรรทัดและนับจำนวนคำของศัพท์ที่ต้องการในไฟล์นั้น"}
{"question_id": 62, "text": "Implement a Python function to find the longest common subsequence of two input strings using dynamic programming.", "category": "coding", "text_th": "เขียนฟังชั่น Python เพื่อหาลำดับย่อยร่วมยาวสุดจากสตริงอินพุตสองอันโดยใช้ Dynamic Programming"}
{"question_id": 63, "text": "Implement a regular expression in Python to validate an email address.", "category": "coding", "text_th": "เขียน Regular Expression ใน Python เพื่อตรวจสอบอีเมล"}
{"question_id": 64, "text": "Write a program to find the nth Fibonacci number using dynamic programming.", "category": "coding", "text_th": "เขียนโปรแกรมเพื่อหาจำนวนที่ n ของจำนวนฟีโบนัชชีโดยใช้ Dynamic Programming"}
{"question_id": 65, "text": "Implement a binary search algorithm to find a specific element in a sorted array.", "category": "coding", "text_th": "สร้างอัลกอริธึมการค้นหาแบบไบนารีเพื่อหาสิ่งใดสิ่งหนึ่งโดยเฉพาะในอาร์เรย์ที่เรียงลำดับแล้ว"}
{"question_id": 66, "text": "Implement a queue data structure using two stacks in Python.", "category": "coding", "text_th": "เขียนโครงสร้างข้อมูลคิวโดยใช้ stack สองอันด้วย Python"}
{"question_id": 67, "text": "Implement a program to find the common elements in two arrays without using any extra data structures.", "category": "coding", "text_th": "เขียนโปรแกรมเพื่อหาสมาชิกที่เหมือนกันในอาร์เรย์สองอันโดยไม่ใช้โครงสร้างข้อมูลใดๆเพิ่ม"}
{"question_id": 68, "text": "Given that f(x) = 5x^3 - 2x + 3, find the value of f(2).", "category": "math", "text_th": "ถ้า f(x) = 5x^3 - 2x + 3 หาค่าของ f(2)"}
{"question_id": 69, "text": "Solve for x in the equation 3x + 10 = 5(x - 2).", "category": "math", "text_th": "หาค่า x จากสมการ 3x + 10 = 5(x - 2)"}
{"question_id": 70, "text": "If the endpoints of a line segment are (2, -2) and (10, 4), what is the length of the segment?", "category": "math", "text_th": "ส่วนของเส้นมีปลายอยู่ที่ (2,-2) และ (10,4) ส่วนของเส้นนี้มีความยาวเท่าใด"}
{"question_id": 71, "text": "Can you help me write a formal email to a potential business partner proposing a joint venture?", "category": "writing", "text_th": "ช่วยเขียนอีเมลอย่างเป็นทางการหาคู่ค้าทางธุรกิจเพื่อเสนอการร่วมทุน"}
{"question_id": 72, "text": "Can you help me write a resignation letter to my current employer, while leaving on good terms and expressing gratitude for the opportunities provided?", "category": "writing", "text_th": "ช่วยเขียนจดหมายลาออกให้เจ้านายปัจจุบัน ให้จากกันด้วยดีและขอบคุณที่นายให้โอกาส"}
{"question_id": 73, "text": "Use an appropriate format to structure a formal letter of recommendation for a student applying to a prestigious graduate program in computer science.", "category": "writing", "text_th": "เขียนจดหมายแนะนำโดยมีโครงสร้างที่เหมาะสมให้นักเรียนเพื่อไปเรียนต่อในโปรแกรมปริญญาเอกชั้นนำสาขาวิทยาศาสตร์คอมพิวเตอร์"}
{"question_id": 74, "text": "Write a compelling product launch announcement email to inform our customers of our new software solution.", "category": "writing", "text_th": "เขียนอีเมลประกาศการออกผลิตภัณฑ์เพื่อแจ้งให้ลูกค้าทราบถึงผลิตภัณฑ์ซอฟท์แวร์ใหม่ของเราอย่างน่าเชื่อถือ"}
{"question_id": 75, "text": "Draft an apology email to a customer who experienced a delay in their order, and provide reassurance that the issue has been resolved.", "category": "writing", "text_th": "เขียนจดหมายขอโทษลูกค้าที่ได้รับสินค้าล่าช้า และให้ความมั่นใจว่าปัญหาได้ถูกแก้แล้ว"}
{"question_id": 76, "text": "Write a script for a YouTube video exploring the history and cultural significance of jazz.", "category": "writing", "text_th": "เขียนสคริปท์สำหรับวิดีโอ Youtube ที่พาไปสำรวจประวัติศาสตร์และวัฒนธรรมดนตรีแจ๊ซ"}
{"question_id": 77, "text": "Compose an engaging travel blog post about a recent trip to Hawaii, highlighting cultural experiences and must-see attractions.", "category": "writing", "text_th": "เขียนบล็อกท่องเที่ยวที่น่าอ่านเกี่ยวกับทริปไปฮาวาย เน้นย้ำเกี่ยวกับประสบการณ์ทางวัฒนธรรมและสถานที่ที่ต้องไปเยี่ยมชม"}
{"question_id": 78, "text": "Write a captivating movie review for a recently released science fiction film, discussing its plot, characters, and special effects.", "category": "writing", "text_th": "เขียนรีวิวหนังที่มีสเน่ห์เกี่ยวกับหนังไซไฟที่เพิ่งเข้าโรง อภิปรายเกี่ยวกับโครงเรื่อง ตัวละคร และสเปเชียลเอฟเฟค"}
{"question_id": 79, "text": "Structure a podcast script for an episode discussing the influence of streaming platforms on the music industry.", "category": "writing", "text_th": "วางโครงสคริปท์พอดคาสต์สำหรับตอนที่เกี่ยวกับอิทธิพลของแพลตฟอร์มสตรีมมิ่งที่มีต่ออุตสาหกรรมดนตรี"}
{"question_id": 80, "text": "Write a symphony concert review, discussing the orchestra's performance and overall audience experience.", "category": "writing", "text_th": "เขียนรีวิวคอนเสิร์ตซิมโฟนี่ อภิปรายผลการแสดงและประสบการณ์ของผู้ชมโดยรวม"}
